[{"text":"Wacky Cake","category":2, "image":"asset:///images/Wacky Cake.jpg","des":" 
Ingredients:
- 1 1/2 cups flour
- 1 cup sugar
- 3 tablespoons cocoa powder
- 1 teaspoon baking soda
- 1/2 teaspoon salt
- 1/3 cup vegetable or canola oil
- 1 tablespoon white or cider vinegar
- 1 teaspoon vanilla
- 1 cup cold water
Powdered sugar for dusting (optional)

Directions:

1. Place an oven rack in the middle of your oven and preheat to 350 degrees F. Grease 8x8-inch square pan, 9-inch round cake pan, or 12 cupcake tins.

2. In a large mixing bowl, sift together flour, sugar, cocoa powder, and baking soda. When finished, make three wells in the dry ingredients.

3. Pour vanilla into first well. Into second well, pour vinegar. Pour oil into third well.

4. Pour cold water over everything and stir until just moist.

5. Bake 30-35 minutes (about 20 minutes for cupcakes) OR until cake springs back when touched OR until a toothpick inserted into the center comes out clean. Remove from oven, let cool, and dust with powdered sugar before serving if desired.
Note: As one commenter noted, the cake is very tender. To serve, keep it in the pan in which it's baked or take extreme care removing it.
"},

{"text":"Quesadilla Pie","category":2, "image":"asset:///images/Quesadilla Pie.jpg","des":"                                              
Ingredients:
- 1 rotisserie chicken (about 2 pounds), skin removed, meat shredded
- 2 cups chunky salsa, divided
- 1/4 cup reduced-fat sour cream
- 3 (7 1/2 inch-diameter) whole-wheat tortillas
- 1 1/4 cups shredded cheddar cheese, divided
- 1 cup baby spinach, divided

Directions:

Adult: Preheat the oven to 375 degrees F.

Kid: In a large bowl, combine the shredded chicken, 1 cup of the salsa and the sour cream. Stir until combined. Spread another 1/2 cup of the salsa onto the bottom of a 9-inch deep-dish pie plate.

Together: Layer one of the tortillas into the pie plate; top with half of the chicken mixture. Sprinkle with 1/2 cup of shredded cheddar cheese and half the spinach. Repeat layering the chicken mixture, cheddar and spinach once more. Top with the remaining tortilla, 1/2 cup salsa and 1/4 cup cheddar cheese.

Adult: Cover with foil and bake 20 minutes. Remove foil and bake 5 minutes more, or until the cheese melts. Let cool slightly before slicing into wedges.

Serves 4

Best for ages 8-11
Nutritional Information Per Serving: 460 calories, 26g carbs, 40g protein, 21g fat, 115mg cholesterol, 1,380mg sodium, 4g fiber"},


{"text":"Grammy's Stuffed Peppers","category":2, "image":"asset:///images/Grammys Stuffed Peppers.jpg","des":" 
Ingredients: 
- 4 medium large peppers (assorted colors)
- 1 pound lean ground beef or turkey or lamb
- 1 small onion, minced
- 1 large rib celery, minced
- 2 cloves garlic, minced
- 3 tablespoons olive oil, plus some for the pan
- 1/2 pound medium-width egg noodles
- 2 cans (15-ounce) tomato sauce
- 1 teaspoon salt
- Freshly ground black pepper to taste
- 1/2 teaspoon oregano plus extra for topping
- 1/4 cup grated Parmesan cheese

Directions: 

Bring a large pot of lightly salted water to a boil. Lightly coat a 9- X 12-inch baking pan with olive oil and set aside. Preheat the oven to 375 degrees F.

Cut the peppers in half; core and seed them. Drop them in the boiling water and simmer on medium-low heat for 6 minutes. Remove the peppers from the water with tongs and let them drain in a colander. Arrange them in the oiled baking pan hollow-side up.

Cook the pasta in the same water as the peppers until it is al dente. Drain the pasta and reserve.

Heat the olive oil in a large saute pan. Add minced vegetables, and saute on medium heat until limp and transparent, stirring frequently (about 5 minutes).

Break up the ground meat into small chunks and add to vegetables. Cook until all the pink has disappeared, chopping the meat into small bits as it browns. Mix in one can of tomato sauce, the cooked noodles, and salt, pepper, and oregano.

Spoon meat mixture evenly into pepper halves, using all of it. Bake stuffed peppers at 375 degrees F for 25 minutes.

Remove from oven and pour second can of tomato sauce over peppers. Sprinkle lightly with oregano and Parmesan cheese. Bake for another 15 minutes. Serve hot.
"},

{"text":"Slow Cooker Mexican Stew","category":2, "image":"asset:///images/Slow Cooker Mexican Stew.jpg","des":" 
Slow Cooker Size: Minimum 5-quart

Ingredients:

- 2 pounds ground beef
- 1 medium onion, chopped
- 1 (15-ounce) can kidney beans
- 1 (15-ounce) can pinto beans
- 1 (15-ounce) can yellow or white hominy
- 1 (15-ounce) whole kernel corn
- 1 (10-ounce) can diced tomatoes with green chilies (like Rotel)
- 1/2 can water
- 1 (1.25-ounce) package taco seasoning (like McCormick)
- 1 (1-ounce) package dry ranch dressing mix (like Hidden Valley Ranch)

Directions:

In a large skillet over medium-high heat, cook onion and ground beef until meat is browned and onion is softened, about 10-15 minutes. Drain. Add meat and onion mixture to slow cooker, and then pour remaining ingredients on top. (Don't drain the cans - pour in liquid and all.) Stir well. Cook on High for 6 hours or Low for 10 hours. Serve with cheddar cheese, sour cream, avocado, corn chips, or cilantro if desired."},






{"text":"Eggplant Parmesan","category":2, "image":"asset:///images/Eggplant Parmesan.jpg","des":"
Ingredients:

For the tomato sauce:
- 1 tablespoon olive oil
- 2 cloves garlic, diced
- 1 (28 ounce) can tomato sauce
- 1 (28 ounce) can whole tomatoes
- Salt and pepper, to taste
- 1 tablespoon dried basil
- 1 tablespoon dried oregano
- 1/4 teaspoon crushed red pepper flakes

To complete the Eggplant Parmesan:
2 large Italian eggplants
Salt, for preparing the eggplant
- 1 cup flour
- 1/4 teaspoon dried basil
- 1/4 teaspoon dried oregano
- 3 eggs
- 2 cups freshly made breadcrumbs
- A little vegetable oil, for drizzling
- 1/2 cup grated Parmesan
- 1 (1 pound) ball fresh mozzarella, diced
- Fresh basil, chopped, to taste

Directions:

To make the tomato sauce:

Adult: Place the olive oil in a large pot over medium-high heat. Add the garlic and saute for 3-5 minutes, or until golden.

Kid: Add the tomato sauce to the pot, stir and add the tomatoes one at a time, breaking them apart with your hands as you add them to the pot.

Together: Sprinkle the tomato sauce mixture with the dried basil, oregano and red pepper flakes. Season with salt and pepper to taste, adjusting any spices if desired. Let the tomato sauce mixture come to a steady simmer, then turn heat down to medium-low and cook, stirring occasionally, for about 45 minutes, or until the sauce has reduced.

To Complete the Eggplant Parmesan:

Adult: Preheat the oven to 450 degrees F and prepare a baking sheet with a light layer of vegetable oil. Transfer the oiled baking sheet to the oven to warm it up.

Adult: Slice the eggplant into 1/2-inch thick rounds. Sprinkle heavily with salt, transfer to a colander and let sit for at least 20 minutes, or until the bitter juices have drained out. Rinse and pat the eggplant slices dry with a paper towel. Combine the flour, dried basil, dried oregano, salt and pepper together in a pie tin.

Kid: Crack the eggs into a small bowl and beat them together using a fork. Place the breadcrumbs in a separate medium bowl.

Together: Set up an assembly line on the counter starting with the spiced flour, then the beaten eggs, then the breadcrumbs. Place a cookie cooling rack above a new baking sheet to finish the assembly line. Dip both sides of each eggplant in the flour, egg, breadcrumbs, shaking the eggplant after every dip and transfer to the cooling rack until you're ready to bake.

Adult: Place the breaded eggplant slices on the hot baking sheet in the oven. Drizzle with a little olive oil. Turn the oven down to 375 degrees F and bake for about 15 minutes. Flip using a spatula and bake another 15 minutes.

Together: Spread about 1/2 cup of sauce on the bottom of an 8x8-inch baking dish. Layer half the baked eggplant slices over the sauce then add another 1/2 cup sauce to top the eggplant rounds and top with 1/4 cup Parmesan. Repeat with the remaining half eggplant rounds, another 1/2 cup sauce and the remaining parmesan.  

Adult: Transfer the baking dish to the oven and bake for about 30 minutes, or until heated through and bubbly. Top with the diced mozzarella and fresh basil to taste. Enjoy!"},


{"text":"Mom's Meatballs","category":2, "image":"asset:///images/Mom's Meatballs.jpg","des":"
Ingredients:

For the meatballs:

- 3 pounds ground beef
- 1/2 cup milk
- 1 cup bread crumbs
- 2 eggs
- 1/4 cup Worcestershire sauce
- 1 small onion, diced
- 1/2 teaspoon pepper

For the sauce:
- 1 (10-ounce) jar grape jelly
- 1 (12-ounce) jar chili sauce

Directions:
1. Preheat oven to 375 degrees F. Mix all meatball ingredients in large bowl and roll into balls about the size of a golf ball. Place meatballs at least a finger-width apart on large cookie sheet with sides (so grease will not run onto oven floor).

2. Bake meatballs for 15 minutes, then remove from pan, and dispose of excess grease. Put meatballs into large pot.

3. In another small saucepan, melt grape jelly and then add chili sauce. Pour over meatballs and serve."},


{"text":"Tomato Pizza","category":1, "image":"asset:///images/Tomato Pizza.jpg","des":"  
Active Time: 35 minutes
Total Time: 3 hour 15 minutes

Ingredients:

For the Italian-style Pizza Dough:
- 1 package regular active or fast-acting dry yeast
- 1/2 cup warm water (105 to 115 degrees F)
- 1 1/4 to 1 1/2 cups all-purpose flour
- 1 teaspoon olive oil
- 1/2 teaspoon salt
- 1/2 teaspoon sugar

For the toppings:
- 4 oz fresh mozzarella cheese, well-drained
- 2 plum (Roma) tomatoes, thinly sliced
- 1/4 teaspoon salt
- Freshly cracked pepper
- 1/4 cup thin strips fresh basil leaves
- 1 tablespoon chopped fresh oregano leaves
- 1 tablespoon small capers, if desired
- 1 tablespoon olive oil

Directions:
1. In a large bowl, dissolve yeast in warm water. Stir in half of the flour, 1 teaspoon oil, 1/2 teaspoon salt and the sugar. Stir in enough of the remaining flour to make dough easy to handle. On lightly floured surface, knead dough about 10 minutes or until smooth and springy.

2. Grease large bowl with shortening. Place dough in bowl, turning dough to grease all sides. Cover; let rise in warm place (80 to 85 degrees F) 20 minutes. Gently push fist into dough to deflate. Cover; refrigerate at least 2 hours but no longer than 48 hours. (If dough doubles in size during refrigeration, gently push fist into dough to deflate.)

3. Move oven rack to lowest position. Heat oven to 425 degrees F. Grease cookie sheet or 12-inch pizza pan with oil. Using floured fingers, press dough into 12-inch round on cookie sheet or pat in pizza pan, pressing dough from center to edge so edge is slightly thicker than center.

4. Cut cheese into 1/4-inch slices. Place cheese on crust to within 1/2 inch of edge. Arrange tomatoes on cheese. Sprinkle with 1/4 tablespoon salt, pepper, 2 tablespoons of the basil, the oregano and capers. Drizzle with 1 tablespoon oil.

5. Bake about 20 minutes or until crust is golden brown and cheese is melted. Sprinkle with remaining 2 tablespoons basil.

Serves 8

Nutritional Information Per Serving: Calories 140, Total Fat 6g (Saturated Fat 2.5 g, Trans Fat 0g), Cholesterol 15mg, Sodium 280mg, Total Carbohydrate 17g (Dietary Fiber 1g), Protein 5g"},


{"text":"Pesto Shrimp Pizza","category":1, "image":"asset:///images/Pesto Shrimp Pizza.jpg","des":"
Ingredients:
- 2 teaspoons active dry yeast
- 1/2 cup warm water (105 to 115 degrees F)
- 2 teaspoons honey
- 2 teaspoons olive oil
- 1/2 cup whole wheat flour
- 2 tablespoons yellow cornmeal
- 1/4 teaspoon salt
- 1/2 to 1 cup all-purpose flour
- 1/2 lb. cooked deveined peeled medium shrimp, thawed if frozen, tail shells removed
- 6 tablespoons refrigerated reduced-fat basil pesto
- 1/2 cup shredded reduced-fat mozzarella cheese (2 oz)

Directions:
1. In a small bowl, dissolve yeast in warm water. Let stand 5 minutes. Stir in honey and oil. In medium bowl, mix whole wheat flour, cornmeal and salt. Stir in yeast mixture. Using a wooden spoon, stir in as much of the all-purpose flour as you can.

2. Place dough on lightly floured surface; knead in enough of the remaining all-purpose flour to make a moderately stiff dough that is smooth and elastic (3 to 4 minutes total). Shape dough into a ball. Cover; let rise in warm place (80 to 85 degrees F) 30 to 45 minutes or until nearly doubled in size.

3. Heat oven to 425 degrees F. Grease 2 small cookie sheets. Punch down dough; divide dough in half. Let rest 10 minutes.

4. On lightly floured surface, roll each dough half to 10- to 12-inch oval. Transfer dough to cookie sheets. Prick dough with fork. Bake 6 to 8 minutes or until lightly browned.

5. Toss shrimp with 2 tablespoons of the pesto. Spread remaining 4 tablespoons pesto over baked crusts. Top with shrimp, sprinkle with cheese. Bake 5 to 8 minutes longer or until cheese is melted.

Serves 16

Nutritional Information Per Serving: Calories 180, Total Fat 7g (Saturated Fat 1.5 g, Trans Fat 0g), Cholesterol 65mg, Sodium 480mg, Total Carbohydrate 17g (Dietary Fiber 2g), Protein 12g
"},


{"text":"Buffalo Chicken Pizza","category":2, "image":"asset:///images/Buffalo Chicken Pizza.jpg","des":" 
Prep Time: 10 minutes
Total Time: 20 minutes

Ingredients:
- 1 package (10oz) prebaked whole wheat thin Italian pizza crust (12 inch)
- 1/4 cup fat-free ranch dressing
- 1/4 cup finely chopped celery
- 1 cup chopped cooked chicken breast
- 3 tablespoons Buffalo wing sauce
- 3/4 cup green and red bell pepper strips
- 3/4 cup shredded reduced-fat mozzarella cheese (3 oz)
- 1 tablespoon crumbled blue cheese

Directions:
1.  Heat oven to 400 degrees F. Place pizza crust on ungreased cookie sheet. Spread ranch dressing over crust. Sprinkle with celery.

2. In small bowl, stir together chicken and Buffalo wing sauce; arrange over crust. Top with bell peppers and cheeses.

3. Bake 10 minutes or until mozzarella is melted and just beginning to brown.

Serves 6

Nutritional Information Per Serving: Calories 250, Total Fat 7G (Saturated Fat 2.5 g, Trans Fat 0g), Cholesterol 30 mg, Sodium 470 mg, Total Carbohydrate 30 g (Dietary Fiber 3g), Protein 15g
"},














{"text":"Apple Walnut Pizza","category":1, "image":"asset:///images/Apple Walnut Pizza.jpg","des":"   
Ingredients:
- 1 homemade or store-bought pizza dough, rolled out
- 3 Granny Smith apples, cored, thinly sliced 
- 1 cup apple juice 
- 1 tablespoon cornstarch 
- 1 teaspoon ground cinnamon 
- 2 tablespoons honey or agave 
- 1/4 cup chopped toasted walnuts 
- 2 cups grated sharp cheddar cheese 

Directions:
1. Place a pizza stone in the oven and preheat oven to 425 degrees F. Place dough on a pizza peel or the back of a large baking sheet dusted with cornmeal.

2. Meanwhile, place apples and apple juice in a large saucepan over medium heat and cook, stirring occasionally, until apples are fork-tender.

3. Drain off juice and reserve. Arrange apple slices on pizza dough. In a small saucepan, whisk together cornstarch, apple juice, cinnamon, and honey or agave. Cook over medium heat until cornstarch is dissolved and mixture is hot. Drizzle sauce over apples. 

4. Sprinkle evenly with walnuts and top with cheese. Slice pizza onto baking stone. Bake for 15 to 20 minutes or until cheese is melted and bubbly, and the crust is crisped. Slice and serve."},








{"text":"Special Vegetable Soup","category":1, "image":"asset:///images/Special Vegetable Soup.jpg","des":"             
Ingredients: 
- 2 tablespoons canola or olive oil
- 1 medium onion, chopped
- 1 rib celery, minced
- 2 cloves garlic, minced
- 1 quart broth (vegetable, chicken or beef-any will work well)
- 1 (28-oz.) can diced tomatoes
- 1 envelope Knorr Vegetable Soup/Dip mix
- 1 (10-oz.) bag frozen mixed vegetables
- 1 tablespoon balsamic or pure apple cider vinegar
- 1 (16-oz.) can beans (white, pinto, black-whatever you have on hand)
Chopped fresh parsley, to taste
Salt & Pepper, to taste

Directions: 
1. Heat a large (4-quart) heavy stock pot over medium heat until drops of water bounce before evaporating. Add oil, chopped onion and celery; saute until translucent. Add garlic and saute until it becomes very fragrant.

2. Add broth, tomatoes, soup mix and cook for a few minutes; then add remaining ingredients except parsley and seasonings.

3. Simmer for 30 minutes; taste to check seasoning, and add salt and freshly ground black pepper to taste. Stir in parsley.

4. Serve with homemade cornbread.
"}









]